In [1]:
import pandas as pd
import openpyxl
from pathlib import Path
input_file = Path.cwd()/'data'/'raw'/'sample_sales.xlsx'
df = pd.read_excel(input_file,engine='openpyxl')
df.head()

     invoice   company purchase_date product  quantity  price  extended amount
0  ZN-870-29  Realcube    2019-03-05   shirt        19     17              323
1  JQ-501-63     Zooxo    2019-07-09    book        30     14              420
2  FI-165-58   Dabtype    2019-08-12  poster         7     23              161
3  XP-005-55  Skipfire    2019-11-18     pen         7     29              203
4  NB-917-18  Bluezoom    2019-04-18  poster        36     19              684

## Aggregation

Simple aggregation

In [11]:
df['price'].agg(['mean'])

mean    22.816
Name: price, dtype: float64

Adding aggregations

In [16]:
df['price'].agg(['mean','std'])

mean    22.816000
std      7.537039
Name: price, dtype: float64

Defining the columns and aggregations in a dictionary

In [17]:
agg_cols = {'quantity':'sum',
            'price':['mean','std'],
           'invoice':'count',
           'extended amount':'sum'}

In [22]:
df.agg(agg_cols)

       quantity      price  invoice  extended amount
sum     22421.0        NaN      NaN         510270.0
mean        NaN  22.816000      NaN              NaN
std         NaN   7.537039      NaN              NaN
count       NaN        NaN   1000.0              NaN

Aggregation across all columns (which sometimes doesn't make sense, e.g. mean of product names)

In [19]:
df.agg(['mean','max'])

,invoice,company,purchase_date,product,quantity,price,extended amount
max,ZY-479-41,Zoozzy,2019-12-30 00:00:00.000,shirt,50.000,35.000,1715.00
mean,NaN,NaN,2019-07-04 17:41:16.800,NaN,22.421,22.816,510.27

Zap those NaN's

In [23]:
df.agg(['mean','max']).fillna("")

,invoice,company,purchase_date,product,quantity,price,extended amount
max,ZY-479-41,Zoozzy,2019-12-30 00:00:00.000,shirt,50.000,35.000,1715.00
mean,,,2019-07-04 17:41:16.800,,22.421,22.816,510.27

## Grouping

Group by product, and sum all values

In [24]:
df.groupby(['product']).sum()

         quantity  price  extended amount
product
book         5340   5115           118356
pen          5005   5271           115017
poster       5827   6258           139008
shirt        6249   6172           137889

Group by product, but only sum over quantity

In [26]:
df.groupby(['product'])['quantity'].sum()

product
book      5340
pen       5005
poster    5827
shirt     6249
Name: quantity, dtype: int64